04_OpenFoam/_ref/OpenFOAM-14/incompressibleVoF/DTCHull/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Mesh if necessary
if ! cloneMesh ../DTCHullMoving . && ! (isTest "$@" && cloneMesh ../DTCHullWave .)
then
    ./Allmesh
else
    runApplication decomposePar -noFields
fi

# Copy the fields into the processor directories
runApplication -a decomposePar -fields -copyZero

# Run
runParallel foamRun

# Reconstruct
runApplication reconstructPar

#------------------------------------------------------------------------------
